{
    "source": "https://www.businessinsider.com/home-sellers-summer-disappointment-mortgage-rates-house-prices-real-estate-2024-5",
    "title": "Home Sellers' Tough Summer: Get Ready for Lower Prices, Fewer Offers",
    "date": null,
    "paragraphs": [
        "already battling high rates and home prices",
        "When hopeful sellers call up Eric Peterson, a real-estate broker in Austin, he usually asks them how much they think their home could fetch on the market. In 2021 or 2022, before rising mortgage rates squashed buyer demand, people typically thought their homes were worth a lot less than what they could sell for, Peterson told me. Now when he poses the same question, \"they're usually overshooting it by a little bit,\" he said. The whiplash can leave today's sellers crestfallen in comparison. Austin was among thecities hit hardest by the pandemic hangover, with local home prices in March down roughly 12% from the peak in May 2022, according to the Freddie Mac House Price Index. But while the city may be on the extreme end of things, sellers around the country face similar circumstances: There are fewer buyers out there, and the ones who are on the hunt have more options.",
        "Of course, it could always be worse. There areno signs that home prices are on the verge of collapse, and more sales are happening now than a year ago. After all, people have to move for a wide variety of life reasons; mortgage rates be damned. The number of homes for sale at any given moment is also growing, which means we're inching closer to a \"normal\" market. TheHousing Ice Ageis slowly thawing.",
        "This story is available exclusively to Business Insider\n                      subscribers.\u0014Become an Insiderand start reading now.Have an account?Log in.Redeem nowThe past few years were very good to people who decided to sell their homes. The massive relocation shuffle meant most homes hitting the market were the subject of bidding wars.Rich baby boomersjumped in with all-cash offers, and sellers scored huge windfalls as weary buyers pushed prices to new heights. There was no question who had the upper hand.This story is available exclusively to Business Insider\n                            subscribers.\u0014Become an Insiderand start reading now.Have an account?Log in.Now, sellers' fortunes are changing. Home prices are still rising, at a modest pace, around most of the country, but gone are the days of throwing up a for-sale sign and waiting for the feeding frenzy to begin. As buyers' options slowly increase, sellers may have toslash asking pricesor wait longer for a viable offer to come along. Today's home shoppers aren't so willing to pass on inspections or give up other contingency rights to expedite a sale, either. Unlike their predecessors at the height of the pandemic, buyers can now afford to kick the tires before jumping into a deal.Most painfully,mortgage rates have spiked to 7%from their record lows of less than 3% in 2021, which has not onlydeterred prospective buyersbut also changed the calculus for many sellers. Since most people have to turn around and buy another property to live in, even the ones who profit handsomely off a sale are finding it hard to upgrade their digs, given the increased borrowing costs. It's shaping up to be a cruel summer for sellers who aren't ready to come to terms with this new reality.AdvertisementOf course, it could always be worse. There areno signs that home prices are on the verge of collapse, and more sales are happening now than a year ago. After all, people have to move for a wide variety of life reasons; mortgage rates be damned. The number of homes for sale at any given moment is also growing, which means we're inching closer to a \"normal\" market. TheHousing Ice Ageis slowly thawing.But the peak months of home selling, which last from the spring into the middle of summer, may come with a rude awakening this year. Those who hoped that lower mortgage rates would grease the wheels of the housing market, nudging more buyers to get off the sidelines and bid up home prices, are realizing that dream scenario won't come to pass. Sellers may still have an advantage, but it's getting slimmer.When hopeful sellers call up Eric Peterson, a real-estate broker in Austin, he usually asks them how much they think their home could fetch on the market. In 2021 or 2022, before rising mortgage rates squashed buyer demand, people typically thought their homes were worth a lot less than what they could sell for, Peterson told me. Now when he poses the same question, \"they're usually overshooting it by a little bit,\" he said. The whiplash can leave today's sellers crestfallen in comparison. Austin was among thecities hit hardest by the pandemic hangover, with local home prices in March down roughly 12% from the peak in May 2022, according to the Freddie Mac House Price Index. But while the city may be on the extreme end of things, sellers around the country face similar circumstances: There are fewer buyers out there, and the ones who are on the hunt have more options.\"The further and further we get from the peak of the market,\" Peterson told me, \"the harder it is to deny what's happened.\"AdvertisementThestart of 2024seemed to have all the ingredients of a second home-seller heyday.Inflation was cooling, meaning theFederal Reserve could soon declare victoryin its war on rising prices and start tocut interest rates. This, in turn, would bring down mortgage rates, theoretically encouraging more buyers to jump into the housing market. Sellers would have the upper hand in two ways: A new wave of demand would drive up the value of their homes, while lower borrowing costs would make the jump to their new places less painful. Unfortunately for prospective sellers,this Goldilocks scenariowas not meant to be. Inflation has been hotter than expected, and the Fed has signaled it's comfortablekeeping interest rates higher for longer. Mortgage rates haven't fallen — in fact, they've gone up about 0.6 percentage points since the start of the year. Selma Hepp, the chief economist at the property-analytics firm CoreLogic, calls this \"the year of the head fake.\"The further and further we get from the peak of the market, the harder it is to deny what's happened.Now, prospective sellers are staring down the reverse of the hoped-for scenario. On the one hand, their cheaper mortgage rates now seem like a gift that won't come along again, which makes it hard to commit to a move. About 58% of outstanding US home loans had interest rates below 4% at the end of last year, according to the Federal Housing Finance Agency. If you put 20% down on a $400,000 house, the difference between a 4% mortgage and a 7% one would be$600 in payments every month. You can see why this is bad for both buyers and sellers — buyers can't stomach paying that much more for the same house, while sellers hold on to the rates they snagged when money was cheap during the COVID-19 health crisis.But many people still have to move even if they don't necessarily want to, and some sellers may be coming to terms with the fact that rates aren't dropping. Once they've swallowed this reality, these sellers will face a less favorable real-estate landscape. As more listings hit the market in the spring and summer, the number of homes for sale at any given moment, otherwise known as active inventory, is expected to grow. Nationwide inventory is up 33% from a year ago, according to thehousing-data firm Altos Research, giving homebuyers better odds of bargaining down prices and scoring concessions.Sure, sale prices in March were up about 6.6% from last year, according to Freddie Mac, but the leading indicators for deals that will close this summer \"aren't nearly that strong,\" Mike Simonsen, the president of Altos Research, said in a recent weekly update. Prices on new listings across the country are basically flat from a year ago, and 33.5% of single-family homes on the market have seen a cut from their original asking prices, the most of any April in a decade. Moody's Ratings now expects home values to rise a measly 1% this year after a 6.5% increase in 2023.AdvertisementEven once a price is agreed upon, sellers may have to shoulder more of the costs to complete the transaction than before. Unlike during the height of the pandemic, a buyer might be able to get thesellerto pay for closing costs or pricey repairs that come up during an inspection. More than one-third of sellers gave concessions to buyers in the three months ending October 31, Redfin found, up from 27.6% two years earlier.Sellers across the country won't feel the pain equally — in fact, many will do just fine for themselves. In the Northeast and the West, active inventory is still more than 30% below 2019 levels, keeping competition for homes tight. The situation will be toughest in places like Austin or Boise, Idaho, where wealthy out-of-towners drove up prices amid the pandemic. Now that people aren't moving across the country as much, it's harder to find the kinds of buyers willing to make outrageous bids for their slice of the Sun Belt.\"When we were listing homes for sale and they were selling for so much over asking price, there often wasn't a second buyer that was offering close to that final price,\" Peterson told me. \"So the market was very emotional in one direction. And I was warning everybody: All it takes is that one buyer to go away.\"Libby Levinson-Katz, a broker in Denver and the chair of the local Realtor association's market-trends committee, said she's advising sellers there to price their homes conservatively and take care of big-ticket items, such as large repairs, before listing. Price-conscious buyers arealready battling high rates and home prices— they don't want to take on more expenses as soon as they get the keys.Advertisement\"I think sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale,\" Levinson-Katz told me. \"It could take awhile because buyers are being really discerning right now.\"Lost in all this talk of sellers' woes is the simple fact thatmore home inventory is good for everyone. Sellers simply had too much power during the pandemic — the pendulum swinging in the other direction just means we're slowly making our way toward a more balanced market.For one thing, many sellers end up also being buyers themselves: A whopping 78% of homeowners say they plan to buy again right after they sell, John Burns Research and Consulting found. So while it might be nice for sellers to watch their home values climb with each desperate bid, they'll probably have to join the masses clamoring over listings or worrying about the new reality of mortgage rates.Sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale.BecauseAmericans see their homes as not only shelter but also investment vehicles, a weak sellers' market can be a problem, too — if prices plummet, buyers might not want to purchase homes for fear of catching a falling knife. This is why economists talk so much about the need for a balanced market, rather than one that simply favors affordability for buyers. It's a fine line to walk.AdvertisementWhile the slowdown for sellers may be good for the country's housing market in the long run, the sudden switch-up can leave homeowners feeling like they missed the boat. About 79% of recent sellers in a survey from Realtor.com said they wished they had listed their home sooner to take advantage of a hotter market. But Peterson told me he tries to keep things in perspective for his clients — home prices are still up almost 50% from early 2020 nationwide, according to Moody's, and about 42% in Austin. He warns sellers against comparing themselves with those who sold at the market's peak, when cheap money drove up prices. Back then, it didn't matter if you mispriced your home or neglected repairs — low interest rates and booming buyer interest practically ensured you'd find a more-than-willing taker.\"It can always be tricky telling somebody that they were just lucky because it makes you sound envious,\" Peterson told me. \"But 2.5% interest rates can hide a lot of mistakes.\"James Rodriguezis a senior reporter on Business Insider's Discourse team.About Discourse StoriesThrough our Discourse journalism, Business Insider seeks to explore and illuminate the day’s most fascinating issues and ideas. Our writers provide thought-provoking perspectives, informed by analysis, reporting, and expertise.\n                              Read more Discourse storieshere.Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily.Read previewThanks for signing up!Access your favorite topics in a personalized feed while you're on the go.download the appEmail addressSign upBy clicking “Sign Up”, you accept ourTerms of ServiceandPrivacy Policy. You can opt-out at any time.Related storiesMore from Real EstateMost popularReal EstateHousing Marketmortgage ratesMore...Advertisement",
        "Access your favorite topics in a personalized feed while you're on the go.download the app",
        "Menu iconA vertical stack of three evenly spaced horizontal lines.Search iconA magnifying glass. It indicates, \"Click to perform a search\".",
        "Search iconA magnifying glass. It indicates, \"Click to perform a search\".",
        "Most painfully,mortgage rates have spiked to 7%from their record lows of less than 3% in 2021, which has not onlydeterred prospective buyersbut also changed the calculus for many sellers. Since most people have to turn around and buy another property to live in, even the ones who profit handsomely off a sale are finding it hard to upgrade their digs, given the increased borrowing costs. It's shaping up to be a cruel summer for sellers who aren't ready to come to terms with this new reality.",
        "DiscourseChevron iconIt indicates an expandable section or menu, or sometimes previous / next navigation options.Real Estate",
        "Share iconAn curved arrow pointing right.ShareFacebook IconThe letter F.FacebookEmail iconAn envelope. It indicates the ability to send an email.EmailTwitter iconA stylized bird with an open mouth, tweeting.TwitterLinkedIn iconLinkedInLink iconAn image of a chain link. It symobilizes a website link url.Copy Link",
        "But the peak months of home selling, which last from the spring into the middle of summer, may come with a rude awakening this year. Those who hoped that lower mortgage rates would grease the wheels of the housing market, nudging more buyers to get off the sidelines and bid up home prices, are realizing that dream scenario won't come to pass. Sellers may still have an advantage, but it's getting slimmer.",
        "no signs that home prices are on the verge of collapse",
        "\"It can always be tricky telling somebody that they were just lucky because it makes you sound envious,\" Peterson told me. \"But 2.5% interest rates can hide a lot of mistakes.\"",
        "Sure, sale prices in March were up about 6.6% from last year, according to Freddie Mac, but the leading indicators for deals that will close this summer \"aren't nearly that strong,\" Mike Simonsen, the president of Altos Research, said in a recent weekly update. Prices on new listings across the country are basically flat from a year ago, and 33.5% of single-family homes on the market have seen a cut from their original asking prices, the most of any April in a decade. Moody's Ratings now expects home values to rise a measly 1% this year after a 6.5% increase in 2023.",
        "Redeem nowThe past few years were very good to people who decided to sell their homes. The massive relocation shuffle meant most homes hitting the market were the subject of bidding wars.Rich baby boomersjumped in with all-cash offers, and sellers scored huge windfalls as weary buyers pushed prices to new heights. There was no question who had the upper hand.This story is available exclusively to Business Insider\n                            subscribers.\u0014Become an Insiderand start reading now.Have an account?Log in.Now, sellers' fortunes are changing. Home prices are still rising, at a modest pace, around most of the country, but gone are the days of throwing up a for-sale sign and waiting for the feeding frenzy to begin. As buyers' options slowly increase, sellers may have toslash asking pricesor wait longer for a viable offer to come along. Today's home shoppers aren't so willing to pass on inspections or give up other contingency rights to expedite a sale, either. Unlike their predecessors at the height of the pandemic, buyers can now afford to kick the tires before jumping into a deal.Most painfully,mortgage rates have spiked to 7%from their record lows of less than 3% in 2021, which has not onlydeterred prospective buyersbut also changed the calculus for many sellers. Since most people have to turn around and buy another property to live in, even the ones who profit handsomely off a sale are finding it hard to upgrade their digs, given the increased borrowing costs. It's shaping up to be a cruel summer for sellers who aren't ready to come to terms with this new reality.AdvertisementOf course, it could always be worse. There areno signs that home prices are on the verge of collapse, and more sales are happening now than a year ago. After all, people have to move for a wide variety of life reasons; mortgage rates be damned. The number of homes for sale at any given moment is also growing, which means we're inching closer to a \"normal\" market. TheHousing Ice Ageis slowly thawing.But the peak months of home selling, which last from the spring into the middle of summer, may come with a rude awakening this year. Those who hoped that lower mortgage rates would grease the wheels of the housing market, nudging more buyers to get off the sidelines and bid up home prices, are realizing that dream scenario won't come to pass. Sellers may still have an advantage, but it's getting slimmer.When hopeful sellers call up Eric Peterson, a real-estate broker in Austin, he usually asks them how much they think their home could fetch on the market. In 2021 or 2022, before rising mortgage rates squashed buyer demand, people typically thought their homes were worth a lot less than what they could sell for, Peterson told me. Now when he poses the same question, \"they're usually overshooting it by a little bit,\" he said. The whiplash can leave today's sellers crestfallen in comparison. Austin was among thecities hit hardest by the pandemic hangover, with local home prices in March down roughly 12% from the peak in May 2022, according to the Freddie Mac House Price Index. But while the city may be on the extreme end of things, sellers around the country face similar circumstances: There are fewer buyers out there, and the ones who are on the hunt have more options.\"The further and further we get from the peak of the market,\" Peterson told me, \"the harder it is to deny what's happened.\"AdvertisementThestart of 2024seemed to have all the ingredients of a second home-seller heyday.Inflation was cooling, meaning theFederal Reserve could soon declare victoryin its war on rising prices and start tocut interest rates. This, in turn, would bring down mortgage rates, theoretically encouraging more buyers to jump into the housing market. Sellers would have the upper hand in two ways: A new wave of demand would drive up the value of their homes, while lower borrowing costs would make the jump to their new places less painful. Unfortunately for prospective sellers,this Goldilocks scenariowas not meant to be. Inflation has been hotter than expected, and the Fed has signaled it's comfortablekeeping interest rates higher for longer. Mortgage rates haven't fallen — in fact, they've gone up about 0.6 percentage points since the start of the year. Selma Hepp, the chief economist at the property-analytics firm CoreLogic, calls this \"the year of the head fake.\"The further and further we get from the peak of the market, the harder it is to deny what's happened.Now, prospective sellers are staring down the reverse of the hoped-for scenario. On the one hand, their cheaper mortgage rates now seem like a gift that won't come along again, which makes it hard to commit to a move. About 58% of outstanding US home loans had interest rates below 4% at the end of last year, according to the Federal Housing Finance Agency. If you put 20% down on a $400,000 house, the difference between a 4% mortgage and a 7% one would be$600 in payments every month. You can see why this is bad for both buyers and sellers — buyers can't stomach paying that much more for the same house, while sellers hold on to the rates they snagged when money was cheap during the COVID-19 health crisis.But many people still have to move even if they don't necessarily want to, and some sellers may be coming to terms with the fact that rates aren't dropping. Once they've swallowed this reality, these sellers will face a less favorable real-estate landscape. As more listings hit the market in the spring and summer, the number of homes for sale at any given moment, otherwise known as active inventory, is expected to grow. Nationwide inventory is up 33% from a year ago, according to thehousing-data firm Altos Research, giving homebuyers better odds of bargaining down prices and scoring concessions.Sure, sale prices in March were up about 6.6% from last year, according to Freddie Mac, but the leading indicators for deals that will close this summer \"aren't nearly that strong,\" Mike Simonsen, the president of Altos Research, said in a recent weekly update. Prices on new listings across the country are basically flat from a year ago, and 33.5% of single-family homes on the market have seen a cut from their original asking prices, the most of any April in a decade. Moody's Ratings now expects home values to rise a measly 1% this year after a 6.5% increase in 2023.AdvertisementEven once a price is agreed upon, sellers may have to shoulder more of the costs to complete the transaction than before. Unlike during the height of the pandemic, a buyer might be able to get thesellerto pay for closing costs or pricey repairs that come up during an inspection. More than one-third of sellers gave concessions to buyers in the three months ending October 31, Redfin found, up from 27.6% two years earlier.Sellers across the country won't feel the pain equally — in fact, many will do just fine for themselves. In the Northeast and the West, active inventory is still more than 30% below 2019 levels, keeping competition for homes tight. The situation will be toughest in places like Austin or Boise, Idaho, where wealthy out-of-towners drove up prices amid the pandemic. Now that people aren't moving across the country as much, it's harder to find the kinds of buyers willing to make outrageous bids for their slice of the Sun Belt.\"When we were listing homes for sale and they were selling for so much over asking price, there often wasn't a second buyer that was offering close to that final price,\" Peterson told me. \"So the market was very emotional in one direction. And I was warning everybody: All it takes is that one buyer to go away.\"Libby Levinson-Katz, a broker in Denver and the chair of the local Realtor association's market-trends committee, said she's advising sellers there to price their homes conservatively and take care of big-ticket items, such as large repairs, before listing. Price-conscious buyers arealready battling high rates and home prices— they don't want to take on more expenses as soon as they get the keys.Advertisement\"I think sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale,\" Levinson-Katz told me. \"It could take awhile because buyers are being really discerning right now.\"Lost in all this talk of sellers' woes is the simple fact thatmore home inventory is good for everyone. Sellers simply had too much power during the pandemic — the pendulum swinging in the other direction just means we're slowly making our way toward a more balanced market.For one thing, many sellers end up also being buyers themselves: A whopping 78% of homeowners say they plan to buy again right after they sell, John Burns Research and Consulting found. So while it might be nice for sellers to watch their home values climb with each desperate bid, they'll probably have to join the masses clamoring over listings or worrying about the new reality of mortgage rates.Sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale.BecauseAmericans see their homes as not only shelter but also investment vehicles, a weak sellers' market can be a problem, too — if prices plummet, buyers might not want to purchase homes for fear of catching a falling knife. This is why economists talk so much about the need for a balanced market, rather than one that simply favors affordability for buyers. It's a fine line to walk.AdvertisementWhile the slowdown for sellers may be good for the country's housing market in the long run, the sudden switch-up can leave homeowners feeling like they missed the boat. About 79% of recent sellers in a survey from Realtor.com said they wished they had listed their home sooner to take advantage of a hotter market. But Peterson told me he tries to keep things in perspective for his clients — home prices are still up almost 50% from early 2020 nationwide, according to Moody's, and about 42% in Austin. He warns sellers against comparing themselves with those who sold at the market's peak, when cheap money drove up prices. Back then, it didn't matter if you mispriced your home or neglected repairs — low interest rates and booming buyer interest practically ensured you'd find a more-than-willing taker.\"It can always be tricky telling somebody that they were just lucky because it makes you sound envious,\" Peterson told me. \"But 2.5% interest rates can hide a lot of mistakes.\"James Rodriguezis a senior reporter on Business Insider's Discourse team.About Discourse StoriesThrough our Discourse journalism, Business Insider seeks to explore and illuminate the day’s most fascinating issues and ideas. Our writers provide thought-provoking perspectives, informed by analysis, reporting, and expertise.\n                              Read more Discourse storieshere.",
        "BecauseAmericans see their homes as not only shelter but also investment vehicles, a weak sellers' market can be a problem, too — if prices plummet, buyers might not want to purchase homes for fear of catching a falling knife. This is why economists talk so much about the need for a balanced market, rather than one that simply favors affordability for buyers. It's a fine line to walk.",
        "Menu iconA vertical stack of three evenly spaced horizontal lines.Search iconA magnifying glass. It indicates, \"Click to perform a search\".Business Insider logoBusiness Insider logoNewslettersSubscribeAccount iconAn icon in the shape of a person's head and shoulders. It often indicates a user profile.Log inSubscribe",
        "The past few years were very good to people who decided to sell their homes. The massive relocation shuffle meant most homes hitting the market were the subject of bidding wars.Rich baby boomersjumped in with all-cash offers, and sellers scored huge windfalls as weary buyers pushed prices to new heights. There was no question who had the upper hand.",
        "Lost in all this talk of sellers' woes is the simple fact thatmore home inventory is good for everyone. Sellers simply had too much power during the pandemic — the pendulum swinging in the other direction just means we're slowly making our way toward a more balanced market.",
        "Account iconAn icon in the shape of a person's head and shoulders. It often indicates a user profile.",
        "Federal Reserve could soon declare victory",
        "more home inventory is good for everyone",
        "James Rodriguezis a senior reporter on Business Insider's Discourse team.",
        "\"The further and further we get from the peak of the market,\" Peterson told me, \"the harder it is to deny what's happened.\"",
        "Sellers across the country won't feel the pain equally — in fact, many will do just fine for themselves. In the Northeast and the West, active inventory is still more than 30% below 2019 levels, keeping competition for homes tight. The situation will be toughest in places like Austin or Boise, Idaho, where wealthy out-of-towners drove up prices amid the pandemic. Now that people aren't moving across the country as much, it's harder to find the kinds of buyers willing to make outrageous bids for their slice of the Sun Belt.",
        "Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily.Read preview",
        "The age of insane bidding wars and desperate dealmaking is coming to an end.",
        "cities hit hardest by the pandemic hangover",
        "Follow us on:*Copyright © 2024Insider Inc. All rights reserved.\n                  Registration on or use of this site constitutes acceptance of ourTerms of ServiceandPrivacy Policy.Contact UsMastheadSitemapDisclaimerAccessibilityCommerce PolicyAdvertising PoliciesJobs @ Business InsiderStock quotes byfinanzen.netReprints & PermissionsYour Privacy ChoicesInternational Editions:United StatesUSInternationalINTLDeutschland & ÖsterreichATDeutschlandDEEspañaESIndiaINJapanJPMéxicoMXNetherlandsNLPolskaPL",
        "Libby Levinson-Katz, a broker in Denver and the chair of the local Realtor association's market-trends committee, said she's advising sellers there to price their homes conservatively and take care of big-ticket items, such as large repairs, before listing. Price-conscious buyers arealready battling high rates and home prices— they don't want to take on more expenses as soon as they get the keys.",
        "\"When we were listing homes for sale and they were selling for so much over asking price, there often wasn't a second buyer that was offering close to that final price,\" Peterson told me. \"So the market was very emotional in one direction. And I was warning everybody: All it takes is that one buyer to go away.\"",
        "This story is available exclusively to Business Insider\n                            subscribers.\u0014Become an Insiderand start reading now.Have an account?Log in.",
        "Chevron iconIt indicates an expandable section or menu, or sometimes previous / next navigation options.Homepage",
        "Redeem nowThe past few years were very good to people who decided to sell their homes. The massive relocation shuffle meant most homes hitting the market were the subject of bidding wars.Rich baby boomersjumped in with all-cash offers, and sellers scored huge windfalls as weary buyers pushed prices to new heights. There was no question who had the upper hand.This story is available exclusively to Business Insider\n                            subscribers.\u0014Become an Insiderand start reading now.Have an account?Log in.Now, sellers' fortunes are changing. Home prices are still rising, at a modest pace, around most of the country, but gone are the days of throwing up a for-sale sign and waiting for the feeding frenzy to begin. As buyers' options slowly increase, sellers may have toslash asking pricesor wait longer for a viable offer to come along. Today's home shoppers aren't so willing to pass on inspections or give up other contingency rights to expedite a sale, either. Unlike their predecessors at the height of the pandemic, buyers can now afford to kick the tires before jumping into a deal.Most painfully,mortgage rates have spiked to 7%from their record lows of less than 3% in 2021, which has not onlydeterred prospective buyersbut also changed the calculus for many sellers. Since most people have to turn around and buy another property to live in, even the ones who profit handsomely off a sale are finding it hard to upgrade their digs, given the increased borrowing costs. It's shaping up to be a cruel summer for sellers who aren't ready to come to terms with this new reality.AdvertisementOf course, it could always be worse. There areno signs that home prices are on the verge of collapse, and more sales are happening now than a year ago. After all, people have to move for a wide variety of life reasons; mortgage rates be damned. The number of homes for sale at any given moment is also growing, which means we're inching closer to a \"normal\" market. TheHousing Ice Ageis slowly thawing.But the peak months of home selling, which last from the spring into the middle of summer, may come with a rude awakening this year. Those who hoped that lower mortgage rates would grease the wheels of the housing market, nudging more buyers to get off the sidelines and bid up home prices, are realizing that dream scenario won't come to pass. Sellers may still have an advantage, but it's getting slimmer.When hopeful sellers call up Eric Peterson, a real-estate broker in Austin, he usually asks them how much they think their home could fetch on the market. In 2021 or 2022, before rising mortgage rates squashed buyer demand, people typically thought their homes were worth a lot less than what they could sell for, Peterson told me. Now when he poses the same question, \"they're usually overshooting it by a little bit,\" he said. The whiplash can leave today's sellers crestfallen in comparison. Austin was among thecities hit hardest by the pandemic hangover, with local home prices in March down roughly 12% from the peak in May 2022, according to the Freddie Mac House Price Index. But while the city may be on the extreme end of things, sellers around the country face similar circumstances: There are fewer buyers out there, and the ones who are on the hunt have more options.\"The further and further we get from the peak of the market,\" Peterson told me, \"the harder it is to deny what's happened.\"AdvertisementThestart of 2024seemed to have all the ingredients of a second home-seller heyday.Inflation was cooling, meaning theFederal Reserve could soon declare victoryin its war on rising prices and start tocut interest rates. This, in turn, would bring down mortgage rates, theoretically encouraging more buyers to jump into the housing market. Sellers would have the upper hand in two ways: A new wave of demand would drive up the value of their homes, while lower borrowing costs would make the jump to their new places less painful. Unfortunately for prospective sellers,this Goldilocks scenariowas not meant to be. Inflation has been hotter than expected, and the Fed has signaled it's comfortablekeeping interest rates higher for longer. Mortgage rates haven't fallen — in fact, they've gone up about 0.6 percentage points since the start of the year. Selma Hepp, the chief economist at the property-analytics firm CoreLogic, calls this \"the year of the head fake.\"The further and further we get from the peak of the market, the harder it is to deny what's happened.Now, prospective sellers are staring down the reverse of the hoped-for scenario. On the one hand, their cheaper mortgage rates now seem like a gift that won't come along again, which makes it hard to commit to a move. About 58% of outstanding US home loans had interest rates below 4% at the end of last year, according to the Federal Housing Finance Agency. If you put 20% down on a $400,000 house, the difference between a 4% mortgage and a 7% one would be$600 in payments every month. You can see why this is bad for both buyers and sellers — buyers can't stomach paying that much more for the same house, while sellers hold on to the rates they snagged when money was cheap during the COVID-19 health crisis.But many people still have to move even if they don't necessarily want to, and some sellers may be coming to terms with the fact that rates aren't dropping. Once they've swallowed this reality, these sellers will face a less favorable real-estate landscape. As more listings hit the market in the spring and summer, the number of homes for sale at any given moment, otherwise known as active inventory, is expected to grow. Nationwide inventory is up 33% from a year ago, according to thehousing-data firm Altos Research, giving homebuyers better odds of bargaining down prices and scoring concessions.Sure, sale prices in March were up about 6.6% from last year, according to Freddie Mac, but the leading indicators for deals that will close this summer \"aren't nearly that strong,\" Mike Simonsen, the president of Altos Research, said in a recent weekly update. Prices on new listings across the country are basically flat from a year ago, and 33.5% of single-family homes on the market have seen a cut from their original asking prices, the most of any April in a decade. Moody's Ratings now expects home values to rise a measly 1% this year after a 6.5% increase in 2023.AdvertisementEven once a price is agreed upon, sellers may have to shoulder more of the costs to complete the transaction than before. Unlike during the height of the pandemic, a buyer might be able to get thesellerto pay for closing costs or pricey repairs that come up during an inspection. More than one-third of sellers gave concessions to buyers in the three months ending October 31, Redfin found, up from 27.6% two years earlier.Sellers across the country won't feel the pain equally — in fact, many will do just fine for themselves. In the Northeast and the West, active inventory is still more than 30% below 2019 levels, keeping competition for homes tight. The situation will be toughest in places like Austin or Boise, Idaho, where wealthy out-of-towners drove up prices amid the pandemic. Now that people aren't moving across the country as much, it's harder to find the kinds of buyers willing to make outrageous bids for their slice of the Sun Belt.\"When we were listing homes for sale and they were selling for so much over asking price, there often wasn't a second buyer that was offering close to that final price,\" Peterson told me. \"So the market was very emotional in one direction. And I was warning everybody: All it takes is that one buyer to go away.\"Libby Levinson-Katz, a broker in Denver and the chair of the local Realtor association's market-trends committee, said she's advising sellers there to price their homes conservatively and take care of big-ticket items, such as large repairs, before listing. Price-conscious buyers arealready battling high rates and home prices— they don't want to take on more expenses as soon as they get the keys.Advertisement\"I think sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale,\" Levinson-Katz told me. \"It could take awhile because buyers are being really discerning right now.\"Lost in all this talk of sellers' woes is the simple fact thatmore home inventory is good for everyone. Sellers simply had too much power during the pandemic — the pendulum swinging in the other direction just means we're slowly making our way toward a more balanced market.For one thing, many sellers end up also being buyers themselves: A whopping 78% of homeowners say they plan to buy again right after they sell, John Burns Research and Consulting found. So while it might be nice for sellers to watch their home values climb with each desperate bid, they'll probably have to join the masses clamoring over listings or worrying about the new reality of mortgage rates.Sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale.BecauseAmericans see their homes as not only shelter but also investment vehicles, a weak sellers' market can be a problem, too — if prices plummet, buyers might not want to purchase homes for fear of catching a falling knife. This is why economists talk so much about the need for a balanced market, rather than one that simply favors affordability for buyers. It's a fine line to walk.AdvertisementWhile the slowdown for sellers may be good for the country's housing market in the long run, the sudden switch-up can leave homeowners feeling like they missed the boat. About 79% of recent sellers in a survey from Realtor.com said they wished they had listed their home sooner to take advantage of a hotter market. But Peterson told me he tries to keep things in perspective for his clients — home prices are still up almost 50% from early 2020 nationwide, according to Moody's, and about 42% in Austin. He warns sellers against comparing themselves with those who sold at the market's peak, when cheap money drove up prices. Back then, it didn't matter if you mispriced your home or neglected repairs — low interest rates and booming buyer interest practically ensured you'd find a more-than-willing taker.\"It can always be tricky telling somebody that they were just lucky because it makes you sound envious,\" Peterson told me. \"But 2.5% interest rates can hide a lot of mistakes.\"James Rodriguezis a senior reporter on Business Insider's Discourse team.",
        "NewslettersSubscribeAccount iconAn icon in the shape of a person's head and shoulders. It often indicates a user profile.Log inSubscribe",
        "Email iconAn envelope. It indicates the ability to send an email.Email",
        "Angle down iconAn icon in the shape of an angle pointing down.Gone are the days of throwing up a for-sale sign and waiting for the feeding frenzy to begin. Home sellers are about to get a rude awakening.Deliormanli/Getty, Olivier Verriest/Getty, Andrei Akushevich/Getty, Tyler Le/BI",
        "Americans see their homes as not only shelter but also investment vehicles",
        "The past few years were very good to people who decided to sell their homes. The massive relocation shuffle meant most homes hitting the market were the subject of bidding wars.Rich baby boomersjumped in with all-cash offers, and sellers scored huge windfalls as weary buyers pushed prices to new heights. There was no question who had the upper hand.This story is available exclusively to Business Insider\n                            subscribers.\u0014Become an Insiderand start reading now.Have an account?Log in.Now, sellers' fortunes are changing. Home prices are still rising, at a modest pace, around most of the country, but gone are the days of throwing up a for-sale sign and waiting for the feeding frenzy to begin. As buyers' options slowly increase, sellers may have toslash asking pricesor wait longer for a viable offer to come along. Today's home shoppers aren't so willing to pass on inspections or give up other contingency rights to expedite a sale, either. Unlike their predecessors at the height of the pandemic, buyers can now afford to kick the tires before jumping into a deal.Most painfully,mortgage rates have spiked to 7%from their record lows of less than 3% in 2021, which has not onlydeterred prospective buyersbut also changed the calculus for many sellers. Since most people have to turn around and buy another property to live in, even the ones who profit handsomely off a sale are finding it hard to upgrade their digs, given the increased borrowing costs. It's shaping up to be a cruel summer for sellers who aren't ready to come to terms with this new reality.AdvertisementOf course, it could always be worse. There areno signs that home prices are on the verge of collapse, and more sales are happening now than a year ago. After all, people have to move for a wide variety of life reasons; mortgage rates be damned. The number of homes for sale at any given moment is also growing, which means we're inching closer to a \"normal\" market. TheHousing Ice Ageis slowly thawing.But the peak months of home selling, which last from the spring into the middle of summer, may come with a rude awakening this year. Those who hoped that lower mortgage rates would grease the wheels of the housing market, nudging more buyers to get off the sidelines and bid up home prices, are realizing that dream scenario won't come to pass. Sellers may still have an advantage, but it's getting slimmer.When hopeful sellers call up Eric Peterson, a real-estate broker in Austin, he usually asks them how much they think their home could fetch on the market. In 2021 or 2022, before rising mortgage rates squashed buyer demand, people typically thought their homes were worth a lot less than what they could sell for, Peterson told me. Now when he poses the same question, \"they're usually overshooting it by a little bit,\" he said. The whiplash can leave today's sellers crestfallen in comparison. Austin was among thecities hit hardest by the pandemic hangover, with local home prices in March down roughly 12% from the peak in May 2022, according to the Freddie Mac House Price Index. But while the city may be on the extreme end of things, sellers around the country face similar circumstances: There are fewer buyers out there, and the ones who are on the hunt have more options.\"The further and further we get from the peak of the market,\" Peterson told me, \"the harder it is to deny what's happened.\"AdvertisementThestart of 2024seemed to have all the ingredients of a second home-seller heyday.Inflation was cooling, meaning theFederal Reserve could soon declare victoryin its war on rising prices and start tocut interest rates. This, in turn, would bring down mortgage rates, theoretically encouraging more buyers to jump into the housing market. Sellers would have the upper hand in two ways: A new wave of demand would drive up the value of their homes, while lower borrowing costs would make the jump to their new places less painful. Unfortunately for prospective sellers,this Goldilocks scenariowas not meant to be. Inflation has been hotter than expected, and the Fed has signaled it's comfortablekeeping interest rates higher for longer. Mortgage rates haven't fallen — in fact, they've gone up about 0.6 percentage points since the start of the year. Selma Hepp, the chief economist at the property-analytics firm CoreLogic, calls this \"the year of the head fake.\"The further and further we get from the peak of the market, the harder it is to deny what's happened.Now, prospective sellers are staring down the reverse of the hoped-for scenario. On the one hand, their cheaper mortgage rates now seem like a gift that won't come along again, which makes it hard to commit to a move. About 58% of outstanding US home loans had interest rates below 4% at the end of last year, according to the Federal Housing Finance Agency. If you put 20% down on a $400,000 house, the difference between a 4% mortgage and a 7% one would be$600 in payments every month. You can see why this is bad for both buyers and sellers — buyers can't stomach paying that much more for the same house, while sellers hold on to the rates they snagged when money was cheap during the COVID-19 health crisis.But many people still have to move even if they don't necessarily want to, and some sellers may be coming to terms with the fact that rates aren't dropping. Once they've swallowed this reality, these sellers will face a less favorable real-estate landscape. As more listings hit the market in the spring and summer, the number of homes for sale at any given moment, otherwise known as active inventory, is expected to grow. Nationwide inventory is up 33% from a year ago, according to thehousing-data firm Altos Research, giving homebuyers better odds of bargaining down prices and scoring concessions.Sure, sale prices in March were up about 6.6% from last year, according to Freddie Mac, but the leading indicators for deals that will close this summer \"aren't nearly that strong,\" Mike Simonsen, the president of Altos Research, said in a recent weekly update. Prices on new listings across the country are basically flat from a year ago, and 33.5% of single-family homes on the market have seen a cut from their original asking prices, the most of any April in a decade. Moody's Ratings now expects home values to rise a measly 1% this year after a 6.5% increase in 2023.AdvertisementEven once a price is agreed upon, sellers may have to shoulder more of the costs to complete the transaction than before. Unlike during the height of the pandemic, a buyer might be able to get thesellerto pay for closing costs or pricey repairs that come up during an inspection. More than one-third of sellers gave concessions to buyers in the three months ending October 31, Redfin found, up from 27.6% two years earlier.Sellers across the country won't feel the pain equally — in fact, many will do just fine for themselves. In the Northeast and the West, active inventory is still more than 30% below 2019 levels, keeping competition for homes tight. The situation will be toughest in places like Austin or Boise, Idaho, where wealthy out-of-towners drove up prices amid the pandemic. Now that people aren't moving across the country as much, it's harder to find the kinds of buyers willing to make outrageous bids for their slice of the Sun Belt.\"When we were listing homes for sale and they were selling for so much over asking price, there often wasn't a second buyer that was offering close to that final price,\" Peterson told me. \"So the market was very emotional in one direction. And I was warning everybody: All it takes is that one buyer to go away.\"Libby Levinson-Katz, a broker in Denver and the chair of the local Realtor association's market-trends committee, said she's advising sellers there to price their homes conservatively and take care of big-ticket items, such as large repairs, before listing. Price-conscious buyers arealready battling high rates and home prices— they don't want to take on more expenses as soon as they get the keys.Advertisement\"I think sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale,\" Levinson-Katz told me. \"It could take awhile because buyers are being really discerning right now.\"Lost in all this talk of sellers' woes is the simple fact thatmore home inventory is good for everyone. Sellers simply had too much power during the pandemic — the pendulum swinging in the other direction just means we're slowly making our way toward a more balanced market.For one thing, many sellers end up also being buyers themselves: A whopping 78% of homeowners say they plan to buy again right after they sell, John Burns Research and Consulting found. So while it might be nice for sellers to watch their home values climb with each desperate bid, they'll probably have to join the masses clamoring over listings or worrying about the new reality of mortgage rates.Sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale.BecauseAmericans see their homes as not only shelter but also investment vehicles, a weak sellers' market can be a problem, too — if prices plummet, buyers might not want to purchase homes for fear of catching a falling knife. This is why economists talk so much about the need for a balanced market, rather than one that simply favors affordability for buyers. It's a fine line to walk.AdvertisementWhile the slowdown for sellers may be good for the country's housing market in the long run, the sudden switch-up can leave homeowners feeling like they missed the boat. About 79% of recent sellers in a survey from Realtor.com said they wished they had listed their home sooner to take advantage of a hotter market. But Peterson told me he tries to keep things in perspective for his clients — home prices are still up almost 50% from early 2020 nationwide, according to Moody's, and about 42% in Austin. He warns sellers against comparing themselves with those who sold at the market's peak, when cheap money drove up prices. Back then, it didn't matter if you mispriced your home or neglected repairs — low interest rates and booming buyer interest practically ensured you'd find a more-than-willing taker.\"It can always be tricky telling somebody that they were just lucky because it makes you sound envious,\" Peterson told me. \"But 2.5% interest rates can hide a lot of mistakes.\"James Rodriguezis a senior reporter on Business Insider's Discourse team.",
        "Now, sellers' fortunes are changing. Home prices are still rising, at a modest pace, around most of the country, but gone are the days of throwing up a for-sale sign and waiting for the feeding frenzy to begin. As buyers' options slowly increase, sellers may have toslash asking pricesor wait longer for a viable offer to come along. Today's home shoppers aren't so willing to pass on inspections or give up other contingency rights to expedite a sale, either. Unlike their predecessors at the height of the pandemic, buyers can now afford to kick the tires before jumping into a deal.",
        "Thanks for signing up!Access your favorite topics in a personalized feed while you're on the go.download the app",
        "Facebook IconThe letter F.FacebookEmail iconAn envelope. It indicates the ability to send an email.EmailTwitter iconA stylized bird with an open mouth, tweeting.TwitterLinkedIn iconLinkedInLink iconAn image of a chain link. It symobilizes a website link url.Copy Link",
        "But many people still have to move even if they don't necessarily want to, and some sellers may be coming to terms with the fact that rates aren't dropping. Once they've swallowed this reality, these sellers will face a less favorable real-estate landscape. As more listings hit the market in the spring and summer, the number of homes for sale at any given moment, otherwise known as active inventory, is expected to grow. Nationwide inventory is up 33% from a year ago, according to thehousing-data firm Altos Research, giving homebuyers better odds of bargaining down prices and scoring concessions.",
        "Through our Discourse journalism, Business Insider seeks to explore and illuminate the day’s most fascinating issues and ideas. Our writers provide thought-provoking perspectives, informed by analysis, reporting, and expertise.\n                              Read more Discourse storieshere.",
        "Thestart of 2024seemed to have all the ingredients of a second home-seller heyday.Inflation was cooling, meaning theFederal Reserve could soon declare victoryin its war on rising prices and start tocut interest rates. This, in turn, would bring down mortgage rates, theoretically encouraging more buyers to jump into the housing market. Sellers would have the upper hand in two ways: A new wave of demand would drive up the value of their homes, while lower borrowing costs would make the jump to their new places less painful. Unfortunately for prospective sellers,this Goldilocks scenariowas not meant to be. Inflation has been hotter than expected, and the Fed has signaled it's comfortablekeeping interest rates higher for longer. Mortgage rates haven't fallen — in fact, they've gone up about 0.6 percentage points since the start of the year. Selma Hepp, the chief economist at the property-analytics firm CoreLogic, calls this \"the year of the head fake.\"",
        "mortgage rates have spiked to 7%",
        "keeping interest rates higher for longer",
        "Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily.Read previewThanks for signing up!Access your favorite topics in a personalized feed while you're on the go.download the appEmail addressSign upBy clicking “Sign Up”, you accept ourTerms of ServiceandPrivacy Policy. You can opt-out at any time.",
        "NewslettersAccount iconAn icon in the shape of a person's head and shoulders. It often indicates a user profile.Log inSubscribe",
        "This story is available exclusively to Business Insider\n                      subscribers.\u0014Become an Insiderand start reading now.Have an account?Log in.",
        "Now, prospective sellers are staring down the reverse of the hoped-for scenario. On the one hand, their cheaper mortgage rates now seem like a gift that won't come along again, which makes it hard to commit to a move. About 58% of outstanding US home loans had interest rates below 4% at the end of last year, according to the Federal Housing Finance Agency. If you put 20% down on a $400,000 house, the difference between a 4% mortgage and a 7% one would be$600 in payments every month. You can see why this is bad for both buyers and sellers — buyers can't stomach paying that much more for the same house, while sellers hold on to the rates they snagged when money was cheap during the COVID-19 health crisis.",
        "Now, sellers' fortunes are changing. Home prices are still rising, at a modest pace, around most of the country, but gone are the days of throwing up a for-sale sign and waiting for the feeding frenzy to begin. As buyers' options slowly increase, sellers may have toslash asking pricesor wait longer for a viable offer to come along. Today's home shoppers aren't so willing to pass on inspections or give up other contingency rights to expedite a sale, either. Unlike their predecessors at the height of the pandemic, buyers can now afford to kick the tires before jumping into a deal.Most painfully,mortgage rates have spiked to 7%from their record lows of less than 3% in 2021, which has not onlydeterred prospective buyersbut also changed the calculus for many sellers. Since most people have to turn around and buy another property to live in, even the ones who profit handsomely off a sale are finding it hard to upgrade their digs, given the increased borrowing costs. It's shaping up to be a cruel summer for sellers who aren't ready to come to terms with this new reality.AdvertisementOf course, it could always be worse. There areno signs that home prices are on the verge of collapse, and more sales are happening now than a year ago. After all, people have to move for a wide variety of life reasons; mortgage rates be damned. The number of homes for sale at any given moment is also growing, which means we're inching closer to a \"normal\" market. TheHousing Ice Ageis slowly thawing.But the peak months of home selling, which last from the spring into the middle of summer, may come with a rude awakening this year. Those who hoped that lower mortgage rates would grease the wheels of the housing market, nudging more buyers to get off the sidelines and bid up home prices, are realizing that dream scenario won't come to pass. Sellers may still have an advantage, but it's getting slimmer.When hopeful sellers call up Eric Peterson, a real-estate broker in Austin, he usually asks them how much they think their home could fetch on the market. In 2021 or 2022, before rising mortgage rates squashed buyer demand, people typically thought their homes were worth a lot less than what they could sell for, Peterson told me. Now when he poses the same question, \"they're usually overshooting it by a little bit,\" he said. The whiplash can leave today's sellers crestfallen in comparison. Austin was among thecities hit hardest by the pandemic hangover, with local home prices in March down roughly 12% from the peak in May 2022, according to the Freddie Mac House Price Index. But while the city may be on the extreme end of things, sellers around the country face similar circumstances: There are fewer buyers out there, and the ones who are on the hunt have more options.\"The further and further we get from the peak of the market,\" Peterson told me, \"the harder it is to deny what's happened.\"AdvertisementThestart of 2024seemed to have all the ingredients of a second home-seller heyday.Inflation was cooling, meaning theFederal Reserve could soon declare victoryin its war on rising prices and start tocut interest rates. This, in turn, would bring down mortgage rates, theoretically encouraging more buyers to jump into the housing market. Sellers would have the upper hand in two ways: A new wave of demand would drive up the value of their homes, while lower borrowing costs would make the jump to their new places less painful. Unfortunately for prospective sellers,this Goldilocks scenariowas not meant to be. Inflation has been hotter than expected, and the Fed has signaled it's comfortablekeeping interest rates higher for longer. Mortgage rates haven't fallen — in fact, they've gone up about 0.6 percentage points since the start of the year. Selma Hepp, the chief economist at the property-analytics firm CoreLogic, calls this \"the year of the head fake.\"The further and further we get from the peak of the market, the harder it is to deny what's happened.Now, prospective sellers are staring down the reverse of the hoped-for scenario. On the one hand, their cheaper mortgage rates now seem like a gift that won't come along again, which makes it hard to commit to a move. About 58% of outstanding US home loans had interest rates below 4% at the end of last year, according to the Federal Housing Finance Agency. If you put 20% down on a $400,000 house, the difference between a 4% mortgage and a 7% one would be$600 in payments every month. You can see why this is bad for both buyers and sellers — buyers can't stomach paying that much more for the same house, while sellers hold on to the rates they snagged when money was cheap during the COVID-19 health crisis.But many people still have to move even if they don't necessarily want to, and some sellers may be coming to terms with the fact that rates aren't dropping. Once they've swallowed this reality, these sellers will face a less favorable real-estate landscape. As more listings hit the market in the spring and summer, the number of homes for sale at any given moment, otherwise known as active inventory, is expected to grow. Nationwide inventory is up 33% from a year ago, according to thehousing-data firm Altos Research, giving homebuyers better odds of bargaining down prices and scoring concessions.Sure, sale prices in March were up about 6.6% from last year, according to Freddie Mac, but the leading indicators for deals that will close this summer \"aren't nearly that strong,\" Mike Simonsen, the president of Altos Research, said in a recent weekly update. Prices on new listings across the country are basically flat from a year ago, and 33.5% of single-family homes on the market have seen a cut from their original asking prices, the most of any April in a decade. Moody's Ratings now expects home values to rise a measly 1% this year after a 6.5% increase in 2023.AdvertisementEven once a price is agreed upon, sellers may have to shoulder more of the costs to complete the transaction than before. Unlike during the height of the pandemic, a buyer might be able to get thesellerto pay for closing costs or pricey repairs that come up during an inspection. More than one-third of sellers gave concessions to buyers in the three months ending October 31, Redfin found, up from 27.6% two years earlier.Sellers across the country won't feel the pain equally — in fact, many will do just fine for themselves. In the Northeast and the West, active inventory is still more than 30% below 2019 levels, keeping competition for homes tight. The situation will be toughest in places like Austin or Boise, Idaho, where wealthy out-of-towners drove up prices amid the pandemic. Now that people aren't moving across the country as much, it's harder to find the kinds of buyers willing to make outrageous bids for their slice of the Sun Belt.\"When we were listing homes for sale and they were selling for so much over asking price, there often wasn't a second buyer that was offering close to that final price,\" Peterson told me. \"So the market was very emotional in one direction. And I was warning everybody: All it takes is that one buyer to go away.\"Libby Levinson-Katz, a broker in Denver and the chair of the local Realtor association's market-trends committee, said she's advising sellers there to price their homes conservatively and take care of big-ticket items, such as large repairs, before listing. Price-conscious buyers arealready battling high rates and home prices— they don't want to take on more expenses as soon as they get the keys.Advertisement\"I think sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale,\" Levinson-Katz told me. \"It could take awhile because buyers are being really discerning right now.\"Lost in all this talk of sellers' woes is the simple fact thatmore home inventory is good for everyone. Sellers simply had too much power during the pandemic — the pendulum swinging in the other direction just means we're slowly making our way toward a more balanced market.For one thing, many sellers end up also being buyers themselves: A whopping 78% of homeowners say they plan to buy again right after they sell, John Burns Research and Consulting found. So while it might be nice for sellers to watch their home values climb with each desperate bid, they'll probably have to join the masses clamoring over listings or worrying about the new reality of mortgage rates.Sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale.BecauseAmericans see their homes as not only shelter but also investment vehicles, a weak sellers' market can be a problem, too — if prices plummet, buyers might not want to purchase homes for fear of catching a falling knife. This is why economists talk so much about the need for a balanced market, rather than one that simply favors affordability for buyers. It's a fine line to walk.AdvertisementWhile the slowdown for sellers may be good for the country's housing market in the long run, the sudden switch-up can leave homeowners feeling like they missed the boat. About 79% of recent sellers in a survey from Realtor.com said they wished they had listed their home sooner to take advantage of a hotter market. But Peterson told me he tries to keep things in perspective for his clients — home prices are still up almost 50% from early 2020 nationwide, according to Moody's, and about 42% in Austin. He warns sellers against comparing themselves with those who sold at the market's peak, when cheap money drove up prices. Back then, it didn't matter if you mispriced your home or neglected repairs — low interest rates and booming buyer interest practically ensured you'd find a more-than-willing taker.\"It can always be tricky telling somebody that they were just lucky because it makes you sound envious,\" Peterson told me. \"But 2.5% interest rates can hide a lot of mistakes.\"James Rodriguezis a senior reporter on Business Insider's Discourse team.",
        "By clicking “Sign Up”, you accept ourTerms of ServiceandPrivacy Policy. You can opt-out at any time.",
        "While the slowdown for sellers may be good for the country's housing market in the long run, the sudden switch-up can leave homeowners feeling like they missed the boat. About 79% of recent sellers in a survey from Realtor.com said they wished they had listed their home sooner to take advantage of a hotter market. But Peterson told me he tries to keep things in perspective for his clients — home prices are still up almost 50% from early 2020 nationwide, according to Moody's, and about 42% in Austin. He warns sellers against comparing themselves with those who sold at the market's peak, when cheap money drove up prices. Back then, it didn't matter if you mispriced your home or neglected repairs — low interest rates and booming buyer interest practically ensured you'd find a more-than-willing taker.",
        "Chevron iconIt indicates an expandable section or menu, or sometimes previous / next navigation options.HomepageNewslettersAccount iconAn icon in the shape of a person's head and shoulders. It often indicates a user profile.Log inSubscribe",
        "Related storiesMore from Real EstateMost popular",
        "\"I think sellers need to kind of buckle the seatbelt and know that it's not necessarily going to be a quick sale,\" Levinson-Katz told me. \"It could take awhile because buyers are being really discerning right now.\"",
        "For one thing, many sellers end up also being buyers themselves: A whopping 78% of homeowners say they plan to buy again right after they sell, John Burns Research and Consulting found. So while it might be nice for sellers to watch their home values climb with each desperate bid, they'll probably have to join the masses clamoring over listings or worrying about the new reality of mortgage rates.",
        "Even once a price is agreed upon, sellers may have to shoulder more of the costs to complete the transaction than before. Unlike during the height of the pandemic, a buyer might be able to get thesellerto pay for closing costs or pricey repairs that come up during an inspection. More than one-third of sellers gave concessions to buyers in the three months ending October 31, Redfin found, up from 27.6% two years earlier."
    ]
}